## Контрольные вопросы
* Как написать программу - с чего начать? Как выбрать тип данных и придумать интерфейс?
* Как работает консольный ввод и вывод?
* Порядок операций в java - что это, попробуйте вспомнить какие-нибудь операторы
* Что такое инкремент и декремент? Чем отличаются ++i от i++?
* Что такое битовый сдвиг (с учетом знака и без)? Что такое дополнительный код?
* Что такое бинарные операции &, ^, |, ~?
* Что такое логические операции &&, ||, !?
* Что такое тернарный оператор ?:  ?
* Что такое "расширенные присваивания": например +=
* Что такое поток управления и граф потока управления?
* Что такое if, else if, else, switch? Как написать if/else, switch?
* Что такое for-loop, как написать for loop и как он исполняется?
* Что такое приведение типов? 
* Чем примитив отличается от объектного типа?
* Что такое область видимости? Какая область видимости у перемнной, объявленной в 
`for(int i = 0; i < 10; i++) { 
    ...
}`
* Чем она отличается от 
int i = 0;
`for(;i<10;i++) {
    ...
}`
* Что значит запись
`for(;;) {
}`
* Какие числа выведет цикл
`for(int i = 2; i <= 19; i++) {
    System.out.println(i);
}`
